In [23]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
from warnings import filterwarnings

import statsmodels.api as sm
import itertools

In [24]:
#This dataset provides monthly totals of a US airline passengers from 1949 to 1960.

In [25]:
df=pd.read_csv("AirPassengers.csv")

In [26]:
df.shape

(144, 2)

In [27]:
df.columns

Index(['Month', '#Passengers'], dtype='object')

In [28]:
df.rename(columns={'#Passengers' :'Passengers'}, inplace=True)

In [29]:
df.head(10)

     Month  Passengers
0  1949-01         112
1  1949-02         118
2  1949-03         132
3  1949-04         129
4  1949-05         121
5  1949-06         135
6  1949-07         148
7  1949-08         148
8  1949-09         136
9  1949-10         119

In [30]:
df.tail()

       Month  Passengers
139  1960-08         606
140  1960-09         508
141  1960-10         461
142  1960-11         390
143  1960-12         432

In [31]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 144 entries, 0 to 143
Data columns (total 2 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Month       144 non-null    object
 1   Passengers  144 non-null    int64
dtypes: int64(1), object(1)
memory usage: 2.4+ KB

In [32]:
df.describe()

       Passengers
count  144.000000
mean   280.298611
std    119.966317
min    104.000000
25%    180.000000
50%    265.500000
75%    360.500000
max    622.000000

In [33]:
df.duplicated().sum()

0

In [34]:
df.isnull().sum()

Month         0
Passengers    0
dtype: int64

In [35]:
# build a time series.

In [36]:
def plot_df(df,x,y, title="",xlabel='Month',ylabel='Passengers',dip=100):
    plt.figure(figsize=(20,8), dpi=dpi)
    plt.plot(x,y, color='tab:red')
    plt,gca().set(title=title, xlabel=xlabel, ylabel=ylabel)
    plt.xticks(rotation=90)
    plt.show()
    plot_df(df,x=df['Month'], y=df['Passengers'],
            title='Number of US Airline passengers from 1949 t0 1960')

In [15]:
df['Month']=pd.to_datetime(df['Month'])

In [16]:
df.set_index('Month', inplace=True)
df.index

DatetimeIndex(['1949-01-01', '1949-02-01', '1949-03-01', '1949-04-01',
               '1949-05-01', '1949-06-01', '1949-07-01', '1949-08-01',
               '1949-09-01', '1949-10-01',
               ...
               '1960-03-01', '1960-04-01', '1960-05-01', '1960-06-01',
               '1960-07-01', '1960-08-01', '1960-09-01', '1960-10-01',
               '1960-11-01', '1960-12-01'],
              dtype='datetime64[ns]', name='Month', length=144, freq=None)

In [17]:
df['year'] = df.index.year

In [18]:
df['Month'] = df.index.month

In [19]:
df['day'] = df.index.day

In [20]:
df.head()

            Passengers  year  Month  day
Month
1949-01-01         112  1949      1    1
1949-02-01         118  1949      2    1
1949-03-01         132  1949      3    1
1949-04-01         129  1949      4    1
1949-05-01         121  1949      5    1

In [21]:
df.head()

            Passengers  year  Month  day
Month
1949-01-01         112  1949      1    1
1949-02-01         118  1949      2    1
1949-03-01         132  1949      3    1
1949-04-01         129  1949      4    1
1949-05-01         121  1949      5    1

In [22]:
y=df["Passengers"].resample('D').mean()
y.head(10)

Month
1949-01-01    112.0
1949-01-02      NaN
1949-01-03      NaN
1949-01-04      NaN
1949-01-05      NaN
1949-01-06      NaN
1949-01-07      NaN
1949-01-08      NaN
1949-01-09      NaN
1949-01-10      NaN
Freq: D, Name: Passengers, dtype: float64